<?php 
#######################################################################################
$key_domain = "0";
$domain = "perfect-rubles.xyz";
#######################################################################################


$start_site = 1;
$min_sum = 1; //Минимум для вывода
$max_sum = 50000; //Максимум для вывода


########################################################################################

//Минимальная Сумма по вкладам в рублях
$tarif1 = 10;
$tarif2 = 501;
$tarif3 = 2001;
$tarif4 = 5001;
//$tarif3 = 200;

########################################################################################





########################################################################################

//Сроки вкладов в часах! Писать только в часах! расчитать можно так кол-во суток умножаем на 24 часа! Пример 25 суток * 24 часа = 600 часов
$srok1 = 2880;
$srok2 = 1080;
$srok3 = 600;
$srok4 = 432;
//$srok3 = 480;

########################################################################################





########################################################################################

//Проценты для вкладов за полный срок! Тоесть к примеру 480 % за 10 дней
$perc_tarif1 = 480; 
$perc_tarif2 = 225;
$perc_tarif3 = 150;
$perc_tarif4 = 126;
//$perc_tarif3 = 0;

########################################################################################







########################################################################################

$time = time(); //Текущее время в формате UNIX
$last_time = $time + 10368000; //Начисление раз в сутки! Что бы сделать к примеру начисление раз в час то вместо числа 86400 прописать 3600
$last_time2 = $time + 3888000; //Начисление раз в сутки! Что бы сделать к примеру начисление раз в час то вместо числа 86400 прописать 3600
$last_time3 = $time + 2160000; //Начисление раз в сутки! Что бы сделать к примеру начисление раз в час то вместо числа 86400 прописать 3600
$last_time4 = $time + 1555200; //Начисление раз в сутки! Что бы сделать к примеру начисление раз в час то вместо числа 86400 прописать 3600
########################################################################################

$ref_percent = 0.07;






########################################################################################

//Начисление процентов по вкладам
$time = time();
$db->Query("SELECT * FROM db_deposit WHERE date_end <= '$time' AND status = 0 ");
while($depo = $db->FetchArray()) {
$user_idd = $depo['id_user'];
$count_n = $depo['count'];
$count_full = $depo['count_full'];
$id_depo = $depo['id'];
$summa = $depo['summa'];
$percent = sprintf("%01.2f", $depo['summa'] / 100 * $depo['percent']);	// процентики

$db->Query("UPDATE db_users SET money_in = money_in + '$percent' , money_in = money_in + '$summa' WHERE id = '$user_idd' LIMIT 1");

	if (intval($count_n) >= $count_full) {
		$db->Query("UPDATE db_deposit SET status = 1 WHERE id = '$id_depo'");
	} else {
		$db->Query("UPDATE db_deposit SET count = count + 1, status = status + 1, date_end = '$last_time'  WHERE id = '$id_depo'");
	}
	
	mail($adminmail, "Status", "Вроде обращается при обновлениях страници в форме начисления!");

}
mail($adminmail, "status", "Вроде обращается при обновлениях страници за формой начисления!");

########################################################################################
?>